espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_s_struct.h
/** Group: ECO registers */
/** Type of mem_registerrnd_eco_high register
 *  MSPI ECO high register
 */
typedef union {
    struct {
        /** mem_registerrnd_eco_high : R/W; bitpos: [31:0]; default: 892;
         *  ECO high register
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t mem_registerrnd_eco_high:32;
    };
    uint32_t val;
} spi_mem_s_registerrnd_eco_high_reg_t;

/** Type of mem_registerrnd_eco_low register
 *  MSPI ECO low register
 */
typedef union {
    struct {
        /** mem_registerrnd_eco_low : R/W; bitpos: [31:0]; default: 892;
         *  ECO low register
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t mem_registerrnd_eco_low:32;
    };
    uint32_t val;
} spi_mem_s_registerrnd_eco_low_reg_t;


/** Group: Version control register */
/** Type of mem_date register
 *  SPI0 version control register
 */
typedef union {
    struct {
        /** mem_date : R/W; bitpos: [27:0]; default: 38834224;
         *  SPI0 register version.
         */
        uint32_t mem_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} spi_mem_s_date_reg_t;


typedef struct {
    volatile spi_mem_s_cmd_reg_t mem_cmd;
    uint32_t reserved_004;
    volatile spi_mem_s_ctrl_reg_t mem_ctrl;
    volatile spi_mem_s_ctrl1_reg_t mem_ctrl1;
    volatile spi_mem_s_ctrl2_reg_t mem_ctrl2;
    volatile spi_mem_s_clock_reg_t mem_clock;
    volatile spi_mem_s_user_reg_t mem_user;
    volatile spi_mem_s_user1_reg_t mem_user1;
    volatile spi_mem_s_user2_reg_t mem_user2;
    uint32_t reserved_024[2];
    volatile spi_mem_s_rd_status_reg_t mem_rd_status;
    uint32_t reserved_030;
    volatile spi_mem_s_misc_reg_t mem_misc;
    uint32_t reserved_038;
    volatile spi_mem_s_cache_fctrl_reg_t mem_cache_fctrl;
    volatile spi_mem_s_cache_sctrl_reg_t mem_cache_sctrl;
    volatile spi_mem_s_sram_cmd_reg_t mem_sram_cmd;
    volatile spi_mem_s_sram_drd_cmd_reg_t mem_sram_drd_cmd;
    volatile spi_mem_s_sram_dwr_cmd_reg_t mem_sram_dwr_cmd;
    volatile spi_mem_s_sram_clk_reg_t mem_sram_clk;
    volatile spi_mem_s_fsm_reg_t mem_fsm;
    uint32_t reserved_058[26];
    volatile spi_mem_s_int_ena_reg_t mem_int_ena;
    volatile spi_mem_s_int_clr_reg_t mem_int_clr;
    volatile spi_mem_s_int_raw_reg_t mem_int_raw;
    volatile spi_mem_s_int_st_reg_t mem_int_st;
    uint32_t reserved_0d0;
    volatile spi_mem_s_ddr_reg_t mem_ddr;
    volatile spi_smem_s__ddr_reg_t smem_ddr;
    volatile spi_mem_s_dll_dly_db_reg_t mem_dll_dly_db;
    volatile spi_mem_s_dll_db_st0_reg_t mem_dll_db_st0;
    volatile spi_mem_s_dll_db_st1_reg_t mem_dll_db_st1;
    uint32_t reserved_0e8[6];
    volatile spi_fmem_s_pmsn_attr_reg_t fmem_pmsn_attr[4];
    volatile spi_fmem_s_pmsn_addr_reg_t fmem_pmsn_addr[4];
    volatile spi_fmem_s_pmsn_size_reg_t fmem_pmsn_size[4];
    volatile spi_smem_s__pmsn_attr_reg_t smem_pmsn_attr[4];
    volatile spi_smem_s__pmsn_addr_reg_t smem_pmsn_addr[4];
    volatile spi_smem_s__pmsn_size_reg_t smem_pmsn_size[4];
    volatile spi_mem_s_pms_reject_reg_t mem_pms_reject;
    volatile spi_mem_s_pms_reject_addr_reg_t mem_pms_reject_addr;
    volatile spi_mem_s_ecc_ctrl_reg_t mem_ecc_ctrl;
    volatile spi_mem_s_ecc_err_addr_reg_t mem_ecc_err_addr;
    volatile spi_mem_s_axi_err_addr_reg_t mem_axi_err_addr;
    volatile spi_smem_s__ecc_ctrl_reg_t smem_ecc_ctrl;
    volatile spi_smem_s__axi_addr_ctrl_reg_t smem_axi_addr_ctrl;
    volatile spi_mem_s_axi_err_resp_en_reg_t mem_axi_err_resp_en;
    volatile spi_mem_s_timing_cali_reg_t mem_timing_cali;
    volatile spi_mem_s_din_mode_reg_t mem_din_mode;
    volatile spi_mem_s_din_num_reg_t mem_din_num;
    volatile spi_mem_s_dout_mode_reg_t mem_dout_mode;
    volatile spi_smem_s__timing_cali_reg_t smem_timing_cali;
    volatile spi_smem_s__din_mode_reg_t smem_din_mode;
    volatile spi_smem_s__din_num_reg_t smem_din_num;
    volatile spi_smem_s__dout_mode_reg_t smem_dout_mode;
    volatile spi_smem_s__ac_reg_t smem_ac;
    volatile spi_smem_s__din_hex_mode_reg_t smem_din_hex_mode;
    volatile spi_smem_s__din_hex_num_reg_t smem_din_hex_num;
    volatile spi_smem_s__dout_hex_mode_reg_t smem_dout_hex_mode;
    uint32_t reserved_1b0[20];
    volatile spi_mem_s_clock_gate_reg_t mem_clock_gate;
    volatile spi_mem_s_nand_flash_en_reg_t mem_nand_flash_en;
    volatile spi_mem_s_nand_flash_sr_addr0_reg_t mem_nand_flash_sr_addr0;
    volatile spi_mem_s_nand_flash_sr_din0_reg_t mem_nand_flash_sr_din0;
    volatile spi_mem_s_nand_flash_cfg_data0_reg_t mem_nand_flash_cfg_data0;
    volatile spi_mem_s_nand_flash_cfg_data1_reg_t mem_nand_flash_cfg_data1;
    volatile spi_mem_s_nand_flash_cfg_data2_reg_t mem_nand_flash_cfg_data2;
    uint32_t reserved_21c[9];
    volatile spi_mem_s_nand_flash_cmd_lut0_reg_t mem_nand_flash_cmd_lut0;
    uint32_t reserved_244[15];
    volatile spi_mem_s_nand_flash_spi_seq0_reg_t mem_nand_flash_spi_seq0;
    uint32_t reserved_284[31];
    volatile spi_mem_s_xts_plain_base_reg_t mem_xts_plain_base;
    uint32_t reserved_304[15];
    volatile spi_mem_s_xts_linesize_reg_t mem_xts_linesize;
    volatile spi_mem_s_xts_destination_reg_t mem_xts_destination;
    volatile spi_mem_s_xts_physical_address_reg_t mem_xts_physical_address;
    volatile spi_mem_s_xts_trigger_reg_t mem_xts_trigger;
    volatile spi_mem_s_xts_release_reg_t mem_xts_release;
    volatile spi_mem_s_xts_destroy_reg_t mem_xts_destroy;
    volatile spi_mem_s_xts_state_reg_t mem_xts_state;
    volatile spi_mem_s_xts_date_reg_t mem_xts_date;
    uint32_t reserved_360[7];
    volatile spi_mem_s_mmu_item_content_reg_t mem_mmu_item_content;
    volatile spi_mem_s_mmu_item_index_reg_t mem_mmu_item_index;
    volatile spi_mem_s_mmu_power_ctrl_reg_t mem_mmu_power_ctrl;
    volatile spi_mem_s_dpa_ctrl_reg_t mem_dpa_ctrl;
    volatile spi_mem_s_xts_pseudo_round_conf_reg_t mem_xts_pseudo_round_conf;
    uint32_t reserved_390[24];
    volatile spi_mem_s_registerrnd_eco_high_reg_t mem_registerrnd_eco_high;
    volatile spi_mem_s_registerrnd_eco_low_reg_t mem_registerrnd_eco_low;
    uint32_t reserved_3f8;
    volatile spi_mem_s_date_reg_t mem_date;
} spi_mem_s_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(spi_mem_s_dev_t) == 0x400, "Invalid size of spi_mem_s_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
